react-lightning-talk.20140730.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html>
<html lang="en">
<head>
<meta charset="utf-8"/>
<title>React.js</title>
<meta name="author" content="(Hunter Hutchinson)"/>
<link rel="stylesheet" href="./reveal.js/css/reveal.min.css"/>
<link rel="stylesheet" href="./reveal.js/css/theme/default.css" id="theme"/>

<!-- If the query includes 'print-pdf', include the PDF print sheet -->
</head>
<body>
<div class="reveal">
<div class="slides">
<section>
<h1>React.js</h1>
<h2>Hunter Hutchinson</h2>
<h2><a href="mailto:hunter.hutchinson@gmail.com">hunter.hutchinson@gmail.com</a></h2>
<h2></h2></section>

<section>
<section id="sec-1" >

<h2>what</h2>
</section>
<section id="sec-1-1" >

<h3>The `V` in `MVC`</h3>
<p>
ReactJS is a client side javascript library that <b>only</b> wants to be the <b>view</b>
</p>
</section>
</section>
<section>
<section id="sec-2" >

<h2>what you heard</h2>
</section>
<section id="sec-2-1" >

<h3>Virtual DOM</h3>
<p>
Yes, ReactJS actually re-renders the 
</p>

</section>
<section id="sec-2-2" >

<h3>Why?</h3>
<div class="org-src-container">

<pre  class="src src-javascript">document.body.innerHTML = "&lt;div id='jam'&gt;Strawberry&lt;/div&gt;"
</pre>
</div>
<p>
<b>really is faster than</b>
</p>
<div class="org-src-container">

<pre  class="src src-javascript">document.getElementById('jam').html("Strawberry");
</pre>
</div>

</section>
<section id="sec-2-3" >

<h3>but seriously, that's not the point</h3>
</section>

</section>
<section>
<section id="sec-3" >

<h2>Reality</h2>
</section>
<section id="sec-3-1" >

<h3>so what <b>is</b> the point?</h3>
<ul class="org-ul"><li class="fragment none">State<br/></li>
<li class="fragment none">Encapsulation<br/></li></ul>

</section>
<section id="sec-3-2" >

<h3>the real <b>reality</b></h3>
<div class="org-src-container">

<pre  class="src src-javascript">     /** @jsx React.DOM */

     var React = require('react');

     module.exports = React.createClass({
	 handleClick: function() {
	     console.log("clicky clikc");
	     this.navigate("/login");
	 },
	 render: function() {
	     var classes = this.props.className || "card col-xs-18 col-sm-6 col-md-4";
	     return (
&lt;div className={classes}&gt;
  &lt;div className="thumbnail"&gt;
    &lt;div className="caption"&gt;
      {/* in-card titlebar */}    
      &lt;div&gt;{this.props.title}&lt;/div&gt;
      {/* body content */}
      &lt;div&gt;{this.props.children}&lt;/div&gt;
      {/* bottom bar composed of links */}
      &lt;div&gt;{this.props.footer}&lt;/div&gt;
    &lt;/div&gt;
  &lt;/div&gt;
&lt;/div&gt;
	     );
	 }
     });
</pre>
</div>
</section>

</section>
<section>
<section id="sec-4" >

<h2>The Elephant in the Room</h2>
</section>
<section id="sec-4-1" >

<h3>JSX</h3>
<p>
A XML syntax that is for all intents and purposes HTML
</p>

</section>
<section id="sec-4-2" >

<h3>Why?</h3>
<p>
Contextulization.  Seeing your layout represented as HTML makes a difference
</p>

</section>
<section id="sec-4-3" >

<h3>Believe me</h3>
<p>
you will prefer this
</p>
<div class="org-src-container">

<pre  class="src src-javascript">render: function() {
    var classes = this.props.className || "card col-xs-18 col-sm-6 col-md-4";
    return (
  &lt;div className={classes}&gt;
    &lt;div className="thumbnail"&gt;
      &lt;div className="caption"&gt;
	{/* in-card titlebar */}    
	&lt;div&gt;{this.props.title}&lt;/div&gt;
	{/* body content */}
	&lt;div&gt;{this.props.children}&lt;/div&gt;
	{/* bottom bar composed of links */}
	&lt;div&gt;{this.props.footer}&lt;/div&gt;
      &lt;/div&gt;
    &lt;/div&gt;
  &lt;/div&gt;
    );
}
</pre>
</div>
<p>
to this
</p>
<div class="org-src-container">

<pre  class="src src-javascript">render: function() {
    var classes = this.props.className || "card col-xs-18 col-sm-6 col-md-4";
    return React.DOM.div({className: classes},
			 React.DOM.div({className: "thumbnail"},
				       React.DOM.div({className: "caption"},
						     React.DOM.div({}, this.props.title),
						     React.DOM.div({}, this.props.children),
						     React.DOM.div({}, this.props.footer)
						    )));
}
</pre>
</div>
</section>

</section>
<section>
<section id="sec-5" >

<h2>Componetize!</h2>
</section>
<section id="sec-5-1" >

<h3>CommonJS</h3>
<p>
<a href="http://www.commonjs.org/">http://www.commonjs.org/</a>
</p>

<p>
A standard for modularized Javascript.
</p>

<p>
The most well known implementation is NPM, The Node Package Manager
<a href="https://www.npmjs.org/">https://www.npmjs.org/</a>
</p>

</section>
<section id="sec-5-2" >

<h3>Browserify</h3>
<p>
<a href="http://browserify.org/">http://browserify.org/</a>
</p>

<p>
Simply, an in browser implementation of NPM
</p>
</section>
<section id="sec-5-2-1" >

<h4></h4>

</section>
<section id="sec-5-3" >

<h3></h3>
</section>

</section>
<section>
<section id="sec-6" >

<h2>Build it!</h2>
</section>
<section id="sec-6-1" >

<h3>Barebones NPM</h3>
<ul class="org-ul"><li class="fragment none">use standard package.json<br/><div class="org-src-container">

<pre  class="src src-javascript">{
    "name": "test-ui",
    "description": "react.js based test ui",
    "version": "0.0.1",
    "devDependencies": {
	"react": "^0.10.0",
	"browserify": "~&gt; 4.1",
	"reactify": "^0.13.1",
	"react-nested-router": "^0.2.1"
    },
    "dependencies": {
	"react": "^0.10.0",
	"react-bootstrap": "^0.10.2",
	"react-async": "^0.9.2",
	"d3": "^3.4.8",
	"superagent": "^0.18.0",
	"q": "^1.0.1",
	"superagent-q": "0.0.1",
	"underscore": "^1.6.0",
	"reactify": "^0.13.1"
    },
    "author": "Hunter Hutchinson",
    "browserify": {
	"transform": [
	    "reactify"
	]
    }
}
</pre>
</div>
<p>
build it
</p>
<pre class="example">
browserify main.js &gt; bundle.js
</pre>

<p>
<b>or</b> if you want to build multiple interdependent components
</p>
<pre class="example">
$ browserify -r ./robot &gt; static/common.js
$ browserify -x ./robot.js beep.js &gt; static/beep.js
$ browserify -x ./robot.js boop.js &gt; static/boop.js
</pre>
</li></ul>

</section>
<section id="sec-6-2" >

<h3>Grunt</h3>
<p>
like Make for NodeJS
</p>
</section>
<section id="sec-6-2-1" >

<h4>the package.json example</h4>
<div class="org-src-container">

<pre  class="src src-javascript">{
    "name": "verve-ui",
    "description": "react.js based verve ui",
    "version": "0.0.1",
    "devDependencies": {
	"react": "^0.10.0",
	"react-bootstrap": "^0.10.2"
    },
    "dependencies": {
	"grunt-react": "^0.8.2",
	"grunt-browserify": "^2.1.0",
	"grunt-contrib-watch": "^0.6.1",
	"react-async": "^0.9.2",
	"react-router-component": "^0.18.3",
	"d3": "^3.4.8",
	"superagent": "^0.18.0",
	"q": "^1.0.1",
	"superagent-q": "0.0.1",
	"underscore": "^1.6.0"
    }
}
</pre>
</div>

</section>
<section id="sec-6-2-2" >

<h4>the Gruntfile.js</h4>
<div class="org-src-container">

<pre  class="src src-javascript">module.exports = function(grunt) {
    grunt.initConfig({
	pkg: grunt.file.readJSON('package.json'),
	watch: {
	    react: {
		files: ['js/react_components/**/*.jsx', 'js/react_components/**/*.js'],
		tasks: ['browserify']
	    }
	},
	browserify: {
	    options: {
		transform: [require('grunt-react').browserify]
	    },
	    client: {
		src: ['js/react_components/**/*.jsx', 'js/react_components/**/*.js'],
		dest: 'js/app.js'
	    }
	}
    });

    grunt.loadNpmTasks('grunt-browserify');
    grunt.loadNpmTasks('grunt-contrib-watch');

    grunt.registerTask('default', [
	'browserify'
    ]);
};
</pre>
</div>

</section>
<section id="sec-6-2-3" >

<h4>build it</h4>
<pre class="example">
grunt;
grunt watch
</pre>
</section>

</section>
<section>
<section id="sec-7" >

<h2>rails solutions</h2>
</section>
<section id="sec-7-1" >

<h3>react-rails</h3>
<p>
<a href="https://github.com/reactjs/react-rails">https://github.com/reactjs/react-rails</a>
</p>
</section>
<section id="sec-7-1-1" >

<h4>pros</h4>
<ul class="org-ul"><li class="fragment none">automatic compilation integrated into rails build<br/><p>
no external node or grunt build processes
</p>
</li>
<li class="fragment none">simple GEM include<br/><div class="org-src-container">

<pre  class="src src-ruby">gem 'react-rails', '~&gt; 1.0.0'
</pre>
</div>
<pre class="example">
bundle install
</pre>
</li>
<li class="fragment none">asset pipeline<br/><p>
application.js
</p>
<div class="org-src-container">

<pre  class="src src-javascript">// app/assets/application.js

//= require turbolinks
//= require react
//= require react_ujs
</pre>
</div>
</li>
<li class="fragment none">JSX support<br/><p>
Just name the file `.js.jsx` and include the JSX docblock
</p>
</li></ul>
</section>
<section id="sec-7-1-2" >

<h4>cons</h4>
<ul class="org-ul"><li class="fragment none">No Mixin support<br/></li>

<li class="fragment none">no commonjs support<br/></li></ul>
</section>
<section id="sec-7-2" >

<h3>browserify-rails</h3>
<p>
<a href="https://github.com/hsume2/browserify-rails">https://github.com/hsume2/browserify-rails</a>
</p>

</section>
<section id="sec-7-2-1" >

<h4>pros</h4>
<ul class="org-ul"><li class="fragment none">automatic compilation integrated into rails build<br/><p>
no external node or grunt build processes
</p>
</li>
<li class="fragment none">simple GEM include<br/><div class="org-src-container">

<pre  class="src src-ruby">gem "browserify-rails", "~&gt; 0.3"
</pre>
</div>
<pre class="example">
bundle install
</pre>
</li>

<li class="fragment none">use standard package.json<br/><p>
PROJECT<sub>ROOT</sub>/package.json
</p>
<div class="org-src-container">

<pre  class="src src-javascript">{
    "name": "test-ui",
    "description": "react.js based test ui",
    "version": "0.0.1",
    "devDependencies": {
	"react": "^0.10.0",
	"browserify": "~&gt; 4.1",
	"reactify": "^0.13.1",
	"react-nested-router": "^0.2.1"
    },
    "dependencies": {
	"react": "^0.10.0",
	"react-bootstrap": "^0.10.2",
	"react-async": "^0.9.2",
	"d3": "^3.4.8",
	"superagent": "^0.18.0",
	"q": "^1.0.1",
	"superagent-q": "0.0.1",
	"underscore": "^1.6.0",
	"reactify": "^0.13.1"
    },
    "author": "Hunter Hutchinson",
    "browserify": {
	"transform": [
	    "reactify"
	]
    }
}
</pre>
</div>
</li></ul>
</section>
<section id="sec-7-2-2" >

<h4>cons</h4>
<ul class="org-ul"><li class="fragment none">not mature<br/><p>
not a large community either
</p>
</li>

<li class="fragment none">issues with production deployment<br/><p>
asset precompilation &amp; Heroku
</p>
</li></ul>
</section>
</section>
</div>
</div>
<script src="./reveal.js/lib/js/head.min.js"></script>
<script src="./reveal.js/js/reveal.min.js"></script>
<script>

        		// Full list of configuration options available here:
        		// https://github.com/hakimel/reveal.js#configuration
        		Reveal.initialize({
        			controls: true,
        			progress: true,
        			history: false,
        			center: true,
                                slideNumber: true,
        			rollingLinks: false,
        			keyboard: true,
        			overview: true,
        			 // slide width
        			 // slide height
        			 // slide margin
        			 // slide minimum scaling factor
        			 // slide maximum scaling factor


        			theme: Reveal.getQueryHash().theme, // available themes are in /css/theme
        			transition: Reveal.getQueryHash().transition || 'default', // default/cube/page/concave/zoom/linear/fade/none
        			transitionSpeed: 'default',

        			// Optional libraries used to extend on reveal.js
        			dependencies: [
        				{ src: './reveal.js/lib/js/classList.js', condition: function() { return !document.body.classList; } }
        				,{ src: './reveal.js/plugin/markdown/showdown.js', condition: function() { return !!document.querySelector( '[data-markdown]' ); } }
        				,{ src: './reveal.js/plugin/markdown/markdown.js', condition: function() { return !!document.querySelector( '[data-markdown]' ); } }
        				,{ src: './reveal.js/plugin/highlight/highlight.js', async: true, callback: function() { hljs.initHighlightingOnLoad(); } }
        				,{ src: './reveal.js/plugin/zoom-js/zoom.js', async: true, condition: function() { return !!document.body.classList; } }
        				,{ src: './reveal.js/plugin/notes/notes.js', async: true, condition: function() { return !!document.body.classList; } }
        				// { src: './reveal.js/plugin/search/search.js', async: true, condition: function() { return !!document.body.classList; } }
        				// { src: './reveal.js/plugin/remotes/remotes.js', async: true, condition: function() { return !!document.body.classList; } }
         				
        			]
        		});
</script>
</body>
</html>
